print("Давайте узнаем площадь данного прямоугольника!")
#выводим свойство данной программы
a=float(input("Введите длину прямоугольника"))
#присваеваем переменной а запрашиваемое и введённое с клавиатуры дробное число
b=float(input("Введите ширину прямоугольника"))
#присваиваем переменной b запрашиваемое и введённое с клавиатуры дробное число
s=a*b
#присваиваем переменной s произведение a и b
print("Площадь данного прямоугольника = " , s)
#и наконец, с помощью print выводим на экран полученное число